## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

In [3]:
# Your code here - remember to use markdown cells for comments as well!

import os,glob
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
folder = "/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/"
os.listdir(folder)
#/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project
#folder = "../../../Projects/dsc-phase-1-project/zippedData/"

['imdb.title.crew.csv.gz',
 'tmdb.movies.csv.gz',
 'imdb.title.akas.csv.gz',
 'imdb.title.ratings.csv.gz',
 'imdb.name.basics.csv.gz',
 'rt.reviews.tsv.gz',
 'imdb.title.basics.csv.gz',
 'rt.movie_info.tsv.gz',
 'tn.movie_budgets.csv.gz',
 'bom.movie_gross.csv.gz',
 'imdb.title.principals.csv.gz']

In [5]:
f"{folder}*.csv*"

'/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/*.csv*'

In [27]:
files = glob.glob(f"{folder}*.csv*")
files[6]

'/Users/ethankunin/Documents/Flatiron/Phase_1/Movie_Project1/dsc-phase-1-project/zippedData/tn.movie_budgets.csv.gz'

In [7]:
files[0].replace('.csv.gz','').split('/')[-1].replace('.','_')

'imdb_title_crew'

In [8]:
tables = {}
dashes='---'*25

for file in files:
    ## Save a variable-friendly version of the file name
    table_name = file.replace('.csv.gz','').split('/')[-1].replace('.','_')
    print(dashes)
    
    ## Load and preview dataframe
    print(f"Preview of {table_name}")
    tables[table_name] = pd.read_csv(file)
    display(tables[table_name].head(5))
    print()

---------------------------------------------------------------------------
Preview of imdb_title_crew

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

---------------------------------------------------------------------------
Preview of tmdb_movies

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

---------------------------------------------------------------------------
Preview of imdb_title_akas

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

---------------------------------------------------------------------------
Preview of imdb_title_ratings

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

---------------------------------------------------------------------------
Preview of imdb_name_basics

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

---------------------------------------------------------------------------
Preview of imdb_title_basics

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

---------------------------------------------------------------------------
Preview of tn_movie_budgets

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

---------------------------------------------------------------------------
Preview of bom_movie_gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

---------------------------------------------------------------------------
Preview of imdb_title_principals

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

### quick description of each file: where I see value

imdb_title_crew - value if I can see how directors/writers are linked to movies

tmdb_movies - nothing really here, maybe genre_ids

imdb_title_akas - needed to join to IMDB base because title_id

imdb_title_ratings - not necessary

imdb_name_basics - can weed out directors/known for can use for movies and then join

imdb_title_basics - useful for runtime and genres

tn_movie_budgets - good for release date (seasons) and profit margin

bom_movie_gross - ^ is superior

imdb_title_principals - can use to figure out director/actor/producer. might be better than imdb_name_basics

In [12]:
filepath0 = files[0]
imdb_title_crew = pd.read_csv(filepath0)
imdb_title_crew.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [13]:
filepath1 = files[1]
tmdb_movies = pd.read_csv(filepath1)
tmdb_movies.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [15]:
filepath2 = files[2]
imdb_title_akas = pd.read_csv(filepath2)
imdb_title_akas.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [17]:
filepath3 = files[3]
imdb_title_ratings = pd.read_csv(filepath3)
imdb_title_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [19]:
filepath4 = files[4]
imdb_name_basics = pd.read_csv(filepath4)
imdb_name_basics.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [29]:
filepath5 = files[5]
imdb_title_basics = pd.read_csv(filepath5)
imdb_title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [30]:
filepath6 = files[6]
tn_movie_budgets = pd.read_csv(filepath6)
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [31]:
filepath7 = files[7]
bom_movie_gross = pd.read_csv(filepath7)
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [32]:
filepath8 = files[8]
imdb_title_principals = pd.read_csv(filepath8)
imdb_title_principals.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [34]:
imdb_title_principals.loc[imdb_title_principals['tconst']== 'tt0323808']

,tconst,ordering,nconst,category,job,characters
3,tt0323808,10,nm0059247,editor,NaN,NaN
4,tt0323808,1,nm3579312,actress,NaN,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,NaN,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,NaN,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,NaN,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,NaN,NaN
9,tt0323808,6,nm0811056,producer,producer,NaN
10,tt0323808,7,nm0914939,producer,producer,NaN
11,tt0323808,8,nm0779346,composer,NaN,NaN
12,tt0323808,9,nm0676104,cinematographer,NaN,NaN

In [37]:
imdb_title_basics.loc[imdb_title_basics['tconst'] == 'tt0323808']

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
39,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"

- Observe that tconst denotes an ID of the title, which links to imdb_title_principals
- Can perform inner join here to determine the actor/director of specified films
- Observe that tconst denotes ID of person, which links imdb_title_principals to imdb_name_basics

In [46]:
# Link category (role) to primary_name (name)
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

q = """SELECT
        itp.category, inb.primary_name, itp.tconst
     FROM
        imdb_title_principals itp
     INNER JOIN
        imdb_name_basics inb
           USING (nconst);"""

role_name = pysqldf(q)

In [52]:
role_name.head()

   category           primary_name     tconst
0     actor           Tommy Dysart  tt0111414
1  director           Frank Howson  tt0111414
2  producer  Barry Porter-Robinson  tt0111414
3    editor            Sean Barton  tt0323808
4   actress        Brittania Nicol  tt0323808

In [58]:
# Link role_name to movie titles using t_const thru imdb_title_basics showing primary_titles
#turn this into a Pandas merge

# q2 = """SELECT
#         rn.category, rn.primary_name, rn.tconst, itb.primary_title
#      FROM
#         role_name rn
#      INNER JOIN
#         imdb_title_basics itb
#            USING (tconst);"""

name_role_movie = role_name.merge(imdb_title_basics, on='tconst', how='left')

#name_role_movie = role_name = pysqldf(q)

In [59]:
name_role_movie.head()

,category,primary_name,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,actor,Tommy Dysart,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
1,director,Frank Howson,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
2,producer,Barry Porter-Robinson,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
3,editor,Sean Barton,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"
4,actress,Brittania Nicol,tt0323808,The Wicker Tree,The Wicker Tree,2011,96.0,"Drama,Horror"

In [60]:
len(name_role_movie)

1027912

In [79]:
# extraneous values s.t. Panic Room will return Panic Room from 2018 not Panic Room made by David Fincher.
# Key aspect is the director. think about how actor names can be added
name_role_movie.loc[name_role_movie['primary_name']=='James Cameron'].sort_values(by='primary_title')

,category,primary_name,tconst,primary_title,original_title,start_year,runtime_minutes,genres
106920,writer,James Cameron,tt0437086,Alita: Battle Angel,Alita: Battle Angel,2019,122.0,"Action,Adventure,Sci-Fi"
912958,archive_footage,James Cameron,tt7105720,Answers to Questions You Didn't Know to Ask Ab...,Answers to Questions You Didn't Know to Ask Ab...,2018,NaN,Documentary
266145,director,James Cameron,tt1630029,Avatar 2,Avatar 2,2021,NaN,"Action,Adventure,Fantasy"
234837,director,James Cameron,tt1757678,Avatar 3,Avatar 3,2023,NaN,"Action,Adventure,Drama"
360612,director,James Cameron,tt3095356,Avatar 4,Avatar 4,2025,NaN,"Action,Adventure,Fantasy"
767316,director,James Cameron,tt5637536,Avatar 5,Avatar 5,2027,NaN,"Action,Adventure,Fantasy"
221401,self,James Cameron,tt2013207,Brian May's Brief History of 3D,Brian May's Brief History of 3D,2011,NaN,Documentary
204036,self,James Cameron,tt2332883,Deepsea Challenge 3D,Deepsea Challenge 3D,2014,91.0,Documentary
643489,self,James Cameron,tt6232592,Diving Deep: The Life and Times of Mike deGruy,Diving Deep: The Life and Times of Mike deGruy,2019,NaN,Documentary
766543,self,James Cameron,tt5241760,Eating You Alive,Eating You Alive,2018,108.0,Documentary
81664,self,James Cameron,tt1927124,Hollywood between Paranoia and Sci-Fi. The Pow...,Science-fiction et paranoïa. La culture de la ...,2011,55.0,Documentary
41028,self,James Cameron,tt2004304,Mission Blue,Mission Blue,2014,95.0,"Documentary,Drama"
528761,self,James Cameron,tt3020814,Reflections on Titanic,Reflections on Titanic,2012,65.0,Documentary
143859,self,James Cameron,tt2306723,Secret Life of Old Rose: The Art of Gloria Stuart,Secret Life of Old Rose: The Art of Gloria Stuart,2012,NaN,Documentary
372340,self,James Cameron,tt4062624,Side by Side Extra: Volume Three,Side by Side Extra: Volume Three,2014,NaN,Documentary
145995,self,James Cameron,tt1745826,Solartaxi: Around the World with the Sun,Solartaxi: Around the World with the Sun,2010,76.0,"Adventure,Documentary"
121818,writer,James Cameron,tt1340138,Terminator Genisys,Terminator Genisys,2015,126.0,"Action,Adventure,Sci-Fi"
676244,writer,James Cameron,tt6450804,Terminator: Dark Fate,Terminator: Dark Fate,2019,NaN,"Action,Adventure,Sci-Fi"
41682,self,James Cameron,tt2169432,Titanic: 100 Years On,Titanic: 100 Years On,2012,70.0,NaN